src/test/java/DataFiles/OrgSearch_NameZip.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:lnrisk:ws:wshealthcare:(internal)@ver=${#Project#ver}">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:OrganizationSearchRequest>
            <!--You may enter the following 6 items in any order-->
            <!--Optional:-->
            <urn:User>
                <!--You may enter the following 38 items in any order-->
                <!--Optional:-->
                <!--type: string-->
                <urn:ReferenceCode/>
                <!--Optional:-->
                <!--type: string-->
                <urn:BillingCode/>
                <!--Optional:-->
                <!--type: string-->
                <urn:QueryId/>
                <!--Optional:-->
                <!--type: string-->
                <urn:CompanyId/>
                <!--Optional:-->
                <!--type: string-->
                <urn:BillingId/>
                <!--Optional:-->
                <!--type: string-->
                <urn:LoginHistoryId/>
                <!--Optional:-->
                <!--type: int-->
                <urn:DebitUnits/>
                <!--Optional:-->
                <!--type: string-->
                <urn:IP/>
                <!--Optional:-->
                <!--type: string-->
                <urn:IndustryClass/>
                <!--Optional:-->
                <!--type: string-->
                <urn:ResultFormat/>
                <!--Optional:-->
                <!--type: string-->
                <urn:LogAsFunction/>
                <!--Optional:-->
                <!--type: string-->
                <urn:LogAsSuplFunction/>
                <!--Optional:-->
                <!--type: string-->
                <urn:SSNMask/>
                <!--Optional:-->
                <!--type: string-->
                <urn:DOBMask/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:ExcludeDMVPII>true</urn:ExcludeDMVPII>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:DLMask/>
                <!--Optional:-->
                <!--type: string-->
                <urn:DataRestrictionMask>${DRM_NO_RESTRICT_ALL}</urn:DataRestrictionMask>
                <!--Optional:-->
                <!--type: string-->
                <urn:DataPermissionMask>${DPM_ALL}</urn:DataPermissionMask>
                <!--Optional:-->
                <!--type: string-->
                <urn:DeathMasterPurpose/>
                <!--Optional:-->
                <!--type: string-->
                <urn:SourceCode/>
                <!--Optional:-->
                <!--type: string-->
                <urn:ApplicationType/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:SSNMaskingOn/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:DLMaskingOn/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:LnBranded>false</urn:LnBranded>
                <!--Optional:-->
                <urn:EndUser>
                    <!--You may enter the following 5 items in any order-->
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:CompanyName/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:StreetAddress1/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:City/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:State/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:Phone/>
                </urn:EndUser>
                <!--Optional:-->
                <!--type: int-->
                <urn:MaxWaitSeconds/>
                <!--Optional:-->
                <!--type: string-->
                <urn:RelatedTransactionId/>
                <!--Optional:-->
                <!--type: string-->
                <urn:AccountNumber/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:OutcomeTrackingOptOut/>
                <!--Optional:-->
                <!--type: string-->
                <urn:ProductType/>
                <!--Optional:-->
                <!--type: string-->
                <urn:BatchJobId/>
                <!--Optional:-->
                <!--type: string-->
                <urn:BatchSequenceNumber/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:ArchiveOptIn/>
                <!--Optional:-->
                <!--type: string-->
                <urn:ProcessSpecId/>
                <!--Optional:-->
                <!--type: string-->
                <urn:ProductCode/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:AllowRoamingBypass/>
                <!--Optional:-->
                <!--type: string-->
                <urn:ConsumerStatementsMask/>
                <!--Optional:-->
                <!--type: ResultOutputType - enumeration: [,X,B,P]-->
                <urn:OutputType/>
            </urn:User>
            <!--Optional:-->
            <urn:RemoteLocations>
                <!--Zero or more repetitions:-->
                <!--type: string-->
                <urn:Item/>
            </urn:RemoteLocations>
            <!--Optional:-->
            <urn:ServiceLocations>
                <!--Zero or more repetitions:-->
                <urn:ServiceLocation>
                    <!--You may enter the following 3 items in any order-->
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:LocationId/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:ServiceName/>
                    <!--Optional:-->
                    <urn:Parameters>
                        <!--Zero or more repetitions:-->
                        <urn:Parameter>
                            <!--You may enter the following 2 items in any order-->
                            <!--Optional:-->
                            <!--type: string-->
                            <urn:Name/>
                            <!--Optional:-->
                            <!--type: string-->
                            <urn:Value/>
                        </urn:Parameter>
                    </urn:Parameters>
                </urn:ServiceLocation>
            </urn:ServiceLocations>
            <!--Optional:-->
            <urn:HealthcareConfig>
                <!--You may enter the following 2 items in any order-->
                <!--Optional:-->
                <!--type: string-->
                <urn:Type/>
                <!--Optional:-->
                <!--type: string-->
                <urn:ProductKey/>
            </urn:HealthcareConfig>
            <!--Optional:-->
            <urn:Options>
                <!--You may enter the following 21 items in any order-->
                <!--Optional:-->
                <!--type: boolean-->
                <urn:StrictMatch/>
                <!--Optional:-->
                <!--type: int-->
                <urn:MaxResults/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:UseNicknames>true</urn:UseNicknames>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeAlsoFound>false</urn:IncludeAlsoFound>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:UsePhonetics>false</urn:UsePhonetics>
                <!--Optional:-->
                <!--type: string-->
                <urn:UserAgent/>
                <!--Optional:-->
                <!--type: integer-->
                <urn:ThresholdLimit>1000</urn:ThresholdLimit>
                <!--Optional:-->
                <!--type: integer-->
                <urn:ReturnCount>25</urn:ReturnCount>
                <!--Optional:-->
                <!--type: integer-->
                <urn:StartingRecord>1</urn:StartingRecord>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeAllSets/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeLicenses>1</urn:IncludeLicenses>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeNPI>1</urn:IncludeNPI>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeDEA>1</urn:IncludeDEA>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeCLIA>1</urn:IncludeCLIA>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeNCPDP>1</urn:IncludeNCPDP>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeAHA>1</urn:IncludeAHA>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludePOS>1</urn:IncludePOS>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeFEIN>1</urn:IncludeFEIN>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:MixedCaseOutput/>
                <!--Optional:-->
                <!--type: unsignedInt-->
                <urn:MatchScoreThreshold/>
                <!--Optional:-->
                <!--type: string-->
                <urn:BestRules>HMS</urn:BestRules>
            </urn:Options>
            <!--Optional:-->
            <urn:SearchBy>
                <!--You may enter the following 15 items in any order-->
                <!--Optional:-->
                <!--type: string-->
                <urn:LNFID/>
                <!--Optional:-->
                <!--type: string-->
                <urn:UniqueId/>
                <!--Optional:-->
                <urn:BusinessIds>
                    <!--You may enter the following 7 items in any order-->
                    <!--Optional:-->
                    <!--type: long-->
                    <urn:DotID/>
                    <!--Optional:-->
                    <!--type: long-->
                    <urn:EmpID/>
                    <!--Optional:-->
                    <!--type: long-->
                    <urn:POWID/>
                    <!--Optional:-->
                    <!--type: long-->
                    <urn:ProxID/>
                    <!--Optional:-->
                    <!--type: long-->
                    <urn:SeleID/>
                    <!--Optional:-->
                    <!--type: long-->
                    <urn:OrgID/>
                    <!--Optional:-->
                    <!--type: long-->
                    <urn:UltID/>
                </urn:BusinessIds>
                <!--Optional:-->
                <!--type: string-->
                <urn:OrganizationName>CARES</urn:OrganizationName>
                <!--Optional:-->
                <urn:Address>
                    <!--You may enter the following 18 items in any order-->
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:StreetNumber/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:StreetPreDirection/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:StreetName/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:StreetSuffix/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:StreetPostDirection/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:UnitDesignation/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:UnitNumber/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:StreetAddress1/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:StreetAddress2/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:City/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:State/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:Zip5>10016</urn:Zip5>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:Zip4/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:County/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:PostalCode/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:StateCityZip/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:Latitude/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:Longitude/>
                </urn:Address>
                <!--Optional:-->
                <!--type: string-->
                <urn:Phone/>
                <!--Optional:-->
                <!--type: string-->
                <urn:LicenseNumber/>
                <!--Optional:-->
                <!--type: string-->
                <urn:LicenseState/>
                <!--Optional:-->
                <!--type: string-->
                <urn:LicenseType/>
                <!--Optional:-->
                <!--type: string-->
                <urn:NPINumber/>
                <!--Optional:-->
                <!--type: string-->
                <urn:DEANumber/>
                <!--Optional:-->
                <!--type: string-->
                <urn:CLIANumber/>
                <!--Optional:-->
                <!--type: string-->
                <urn:PharmacyProviderId/>
                <!--Optional:-->
                <!--type: string-->
                <urn:FEIN/>
                <!--Optional:-->
                <urn:LegacyIds>
                    <!--Zero or more repetitions:-->
                    <urn:LegacyId>
                        <!--You may enter the following 2 items in any order-->
                        <!--Optional:-->
                        <!--type: string-->
                        <urn:Id/>
                        <!--Optional:-->
                        <!--type: string-->
                        <urn:Source/>
                    </urn:LegacyId>
                </urn:LegacyIds>
            </urn:SearchBy>
        </urn:OrganizationSearchRequest>
    </soapenv:Body>
</soapenv:Envelope>